/*************************************************************************
	> File Name: 28.cpp
	> Author: godxin999
	> Mail: A996570107@163.com
	> Created Time: 2024/1/20 21:48:40
 ************************************************************************/

//C++17之后，函数表达式一定在函数的参数之前求值，即foo(a,b,c)中foo一定在a,b,c之前求值，但是参数的求值顺序是未定义的
//对于后缀表达式和移位操作符，表达式求值顺序从左往右
//E1[E2]、E1.E2、E1.*E2、E1->*E2、E1<<E2、E1>>E2的求值顺序从左往右
//对于赋值表达式，表达式求值从右往左
//E1=E2、E1*=E2、E1/=E2、E1%=E2、E1+=E2、E1-=E2、E1<<=E2、E1>>=E2、E1&=E2、E1^=E2、E1|=E2的求值顺序从右往左
//对于new表达式，new T(E)中内存分配总是优先于T构造函数中参数E的求值
//涉及重载运算符的表达式的求值顺序应由与之相应的内置运算符的求值顺序确定，而不是函数调用的顺序规则
int main(){





    return 0;
}