/*************************************************************************
	> File Name: test.cpp
	> Author: godxin999
	> Mail: A996570107@163.com
	> Created Time: 2023/10/15 19:26:20
 ************************************************************************/

#include <iostream>
#include <algorithm>
#include <cstring>

//NR.1 不要坚持认为声明都应该放在函数的最上面
//NR.2 不要坚持在一个函数中只保留一条return语句
//NR.3 不要避免使用异常
//NR.4 不要坚持把每个类声明放到独立的源文件中
//正确的方式是使用命名空间
//NR.5 不要采用两阶段初始化
//将所有初始化和验证逻辑均放在一个构造函数中，并使用委托构造函数
//NR.6 不要把所有清理操作放在函数末尾并使用goto exit
//NR.7 不要使所有数据成员protected



int main(){





	return 0;
}